answers_with_que = {
    "Для того, чтобы изменить диск загрузки операционной системы, необходимо:": [
        "перезагрузить компьютер, зайти в BIOS, изменить приоритет загрузки"],
    "Отметьте сквозные технологии «Индустрии 4.0»:": ["большие данные (Big Data)", "автоматизация производства",
                                                      "беспроводная связь 5G", "промышленный интернет"],
    "Что подразумевают под понятием «Интернет вещей»:": [
        "сеть, которая позволяет объединять технические устройства в единую сеть"],
    "Если объединить множество A со множеством B, где A = {2, 4, 7, 8, 9, 10, 12}, B = {2, 3, 4, 7, 9, 10, 11, 15}, то результатом будет:": [
        "{2, 3, 4, 7, 8, 9, 10, 11, 12, 15}"],
    "Третья промышленная революция характеризуется:": ["появлением энергетических технологий",
                                                       "появлением электроники и информационных технологий",
                                                       "автоматизацией производства"],
    "Вы открыли командную строку по адресу: C:\Omgups\ Для того, чтобы создать папку «DT» в корне диска E необходимо последовательно выполнить:": [
        "1) E: 2) mkdir DT", "1) E: 2) md DT"],
    "Отметьте MAC адрес:": ["C5-D0-98-K3-T3-98"],
    "Каким способом можно определить ip адрес компьютера:": ["в командной строке выполнить команду ipconfig /all",
                                                             "в командной строке выполнить команду ipconfig"],
    "Функция MsgBox выводит данные с помощью:": ["диалогового окна"],
    "Отметьте источники Больших данных:": ["данные о покупках в сетевом продуктовом гипермаркете",
                                           "данные о местоположении жителей г. Омск"]
}

answers = [['перезагрузить компьютер, зайти в BIOS, изменить приоритет загрузки'],
           ['большие данные (Big Data)', 'автоматизация производства', 'беспроводная связь 5G',
            'промышленный интернет'],
           ['сеть, которая позволяет объединять технические устройства в единую сеть'],
           ['{2, 3, 4, 7, 8, 9, 10, 11, 12, 15}'],
           ['появлением энергетических технологий', 'появлением электроники и информационных технологий',
            'автоматизацией производства'], ['1) E: 2) mkdir DT', '1) E: 2) md DT'], ['C5-D0-98-K3-T3-98'],
           ['в командной строке выполнить команду ipconfig /all', 'в командной строке выполнить команду ipconfig'],
           ['диалогового окна'],
           ['данные о покупках в сетевом продуктовом гипермаркете', 'данные о местоположении жителей г. Омск']]
