quiz = {
    "1": {
        "question": "Какой цвет у неба?",
        "answers": [
            "Синий",
            "Зеленый",
            "Красный",
            "Желтый"
        ],
        "correct_answer": "Синий",
        "user_answer": ""
    },
    "2": {
        "question": "Сколько планет в солнечной системе?",
        "answers": [
            "7",
            "8",
            "9",
            "10"
        ],
        "correct_answer": "8",
        "user_answer": ""
    },
    "3": {
        "question": "Какой газ самый распространенный в атмосфере Земли?",
        "answers": [
            "Кислород",
            "Азот",
            "Углекислый газ",
            "Аргон"
        ],
        "correct_answer": "Азот",
        "user_answer": ""
    }
}
